-- ------------------------------------------------------
-- Oracle Type Conversions (Chapter03 - page 52 참고)
-- ------------------------------------------------------
-- 1. 자동 형변환 (묵시적 형변환) - Promotion
--
--    <NUMBER> <--> <CHARACTER> <--> <DATE>
--
-- 2. 강제 형변환 (명시적 형변환) - Casting
--
-- (1) <NUMBER>     -- TO_CHAR      --> <CHARACTER>
--     <CHARACTER>  -- TO_NUMBER    --> <NUMBER>
-- (2) <CHARACTER>  -- TO_DATE      --> <DATE>
--     <DATE>       -- TO_CHAR      --> <CHARACTER>
-- (3) <NUMBER>     --    X         --> <DATE>
--     <DATE>       --    X         --> <NUMBER>
-- ------------------------------------------------------

-- ------------------------------------------------------
-- (0) 자동 형변환 (Promotion) 예
-- ------------------------------------------------------
-- 문자타입(CHARACTER) --> 숫자타입(NUMBER)
-- ------------------------------------------------------
DESC employees;

SELECT
    last_name,
    salary
FROM
    employees
WHERE
    salary = '17000';

-- ------------------------------------------------------
-- (4) 변환 (처리)함수 - TO_CHAR
-- ------------------------------------------------------
-- 1. 날짜 데이터를 문자 데이터로 변환
--    예: TO_CHAR( hire_date, 'YYYY' )
--
-- 2. 숫자 데이터를 문자 데이터로 변환
--    예: TO_CHAR( 123456, '999,999' )
-- ------------------------------------------------------

-- ------------------------------------------------------
-- 1. 날짜 데이터를 문자 데이터로 변환
--    예: TO_CHAR( hire_date, 'YYYY' )
-- ------------------------------------------------------
SELECT
    to_char(sysdate, 'YYYY/MM/DD, (AM) DY HH24:MI:SS')
FROM
    dual;

SELECT
    last_name,
    hire_date,
    salary
FROM
    employees
WHERE
    to_char(hire_date, 'MM') = '09';

SELECT
    to_char(sysdate, ' YYYY"년" MM"월" DD"일" ') AS 날짜
FROM
    dual;

-- ------------------------------------------------------
-- 2. 숫자 데이터를 문자 데이터로 변환
--    예: TO_CHAR( 123456, '999,999' )
-- ------------------------------------------------------

--1) 숫자 출력 형식
SELECT
    to_char(1234,'99999')       AS "99999",                 --9: 한자리의 숫자 표현
    to_char(1234,'099999')      AS "099999",                --0: 앞부분을 0으로 표현
    to_char(1234,'$99999')      AS "$99999",                --$: 달러 기호를 앞에 표현
    to_char(1234,'99999.99')    AS "99999.99",              --.: 소수점을 표시
    to_char(1234,'99,999')      AS "99,999",                --,: 특정 위치에 , 표시
    to_char(1234,'B9999.99')    AS "B9999.99",              --B: 공백을 0으로 표현
    to_char(1234,'B99999')      AS "B99999",                --B: 공백을 0으로 표현
    to_char(1234,'L99999')      AS "L99999"                 --L: 지역 통화(Local currency)
FROM
    dual;

SELECT
    to_char(12345678, '909,999,999,999') || ' 바보' AS "909,999,999,999",
    to_char(12345678, '099,999,999,999') || ' 바보' AS "099,999,999,999",
    to_char(12345678, '000,000,000,000') || ' 바보' AS "000,000,000,000",
    to_char(12345678, 'B099,099,999,999') || ' 바보'AS "B099,099,999,999",
    to_char(12345678, 'B909,099,999,999') || ' 바보'AS "B909,099,999,999",
    to_char(12345678, '999,999,999,999') || ' 바보' AS "999,999,999,999"
FROM
    dual;

-- 2) 화폐 출력형식
SELECT 
    last_name,
    salary,
    to_char(salary, '$999,999') 달러,
    to_char(salary, 'L999,999') AS 시스템통화,
    '원'|| to_char(salary, '999,999') AS 원화
FROM
    employees;

-- ------------------------------------------------------
-- (4) 변환 (처리)함수 - TO_NUMBER
-- ------------------------------------------------------
-- 문자 데이터를 숫자 데이터로 변환
-- ------------------------------------------------------
SELECT
    to_number('123') + 100,                 --강제형변환        :***추천
    '123' + 100,                            --자동형변환        :비추
    to_char(123) || '456',                  --강제형변환        :***추천
    123 || '456'                            --자동형변환        :비추
FROM
    dual;

-- ------------------------------------------------------
-- (4) 변환 (처리)함수 - TO_DATE
-- ------------------------------------------------------
-- '날짜형태'의 문자 데이터를 날짜 데이터로 변환
-- ------------------------------------------------------

-- 1) To change Oracle's default date format
--    * Oracle SQL*Developer 에서도 수행해볼 것!
ALTER SESSION SET NLS_DATE_FORMAT='RR/MM/DD';
ALTER SESSION SET NLS_DATE_FORMAT='YYYY/MM/DD HH24:MI:SS';

SELECT sysdate
FROM dual;


-- 2) to_date 응용
SELECT 
    to_date('20170802181030', 'YYYYMMDDHH24MISS')
FROM
    dual;