-- ------------------------------------------------------
-- (0) 현 Oracle 서버의 날짜표기형식(DATE FORMAT) 설정확인
-- ------------------------------------------------------
-- Oracle NLS: National Language Support
-- 오라클의 년도표기 방식 (page 41 ~ 42 참고)
-- ------------------------------------------------------
DESC nls_session_parameters;

--sql developer에서는 date-format이 다르게 나온다.
SELECT
    *
FROM
    nls_session_parameters;

-- ------------------------------------------------------
-- * To change Oracle's default date format
-- ------------------------------------------------------
-- Oracle SQL*Developer 에서도 수행해볼 것!
-- ------------------------------------------------------
ALTER SESSION SET NLS_DATE_FORMAT='RR/MM/DD';

SELECT 
    sysdate
FROM
    dual;

-- ------------------------------------------------------
-- (1) 날짜 (처리)함수 - SYSDATE
-- ------------------------------------------------------
-- DB서버에 설정된 날짜를 반환
-- ------------------------------------------------------
SELECT
    sysdate
FROM
    dual;

-- 날짜 + 숫자      : 일수를 더하여 반환
-- 날짜 - 날짜      : 두 날짜의 차이(일수) 반환
-- 날짜 + 숫자/24   : 시간을 더하여 반환
SELECT
    sysdate     AS 오늘,
    sysdate + 1 AS 내일,
    sysdate - 1 AS 어제
FROM
    dual;

SELECT
    last_name,                              
    hire_date,      
    sysdate - hire_date,                    --현재날짜 - 채용일자 = 기간(일수)
    (sysdate - hire_date) / 365,            --근속기간(일수) / 365 = 근속년수 소숫점 포함
    trunc( (sysdate - hire_date) / 365 )    --소숫점 없는 극속 년수
FROM
    employees
ORDER BY
    3 DESC;     --SELECT문의 3번째를 기준으로 정렬한다.

-- ------------------------------------------------------
-- (2) 날짜 (처리)함수 - MONTH_BETWEEN
-- ------------------------------------------------------
-- 두 날짜 사이의 월수를 계산하여 반환
-- ------------------------------------------------------
SELECT
    last_name,
    hire_date,
    months_between(sysdate, hire_date) AS "근속월수(소숫점포함)",
    trunc(months_between(sysdate, hire_date)) AS "근속월수",
    trunc(months_between(sysdate, hire_date) / 12) AS "근속년수"
FROM
    employees
ORDER BY
    3 DESC;

-- ------------------------------------------------------
-- (3) 날짜 (처리)함수 - ADD_MONTHS
-- ------------------------------------------------------
-- 특정 개월수를 더한 날짜를 계산하여 반환
-- 음수값을 지정하면 뺀 날짜를 반환
-- ------------------------------------------------------
SELECT
    sysdate AS 오늘,
    add_months(sysdate, 1) AS "1개월후 오늘",
    add_months(sysdate,-1) AS "1개월전 오늘"
FROM
    dual;

-- ------------------------------------------------------
-- (4) 날짜 (처리)함수 - NEXT_DAY
-- ------------------------------------------------------
-- 명시된 날짜로부터, 다음 요일에 대한 날짜 반환
-- 일요일(1), 월요일(2) ~ 토요일(7)
-- ------------------------------------------------------
-- NEXT_DAY(date1, {'string' | n})
-- ------------------------------------------------------
SELECT
    last_name,
    hire_date,

--  최초로 돌아오는 금요일에 해당하는 날짜 출력
    next_day(hire_date, 'FRI'),

--  최초로 돌아오는 금요일에 해당하는 날짜 출력
    next_day(hire_date,6)
FROM
    employees
ORDER BY
    3 DESC;


-- ------------------------------------------------------
-- (5) 날짜 (처리)함수 - LAST_DAY
-- ------------------------------------------------------
-- 지정된 월의 마지막 날짜 반환
-- 윤년 및 평년 모두 자동으로 계산
-- ------------------------------------------------------
-- LAST_DAY(date1)
-- ------------------------------------------------------
SELECT
    last_name,
    hire_date,

--  채용일자가 속한 그 달의 마지막 날짜 반환
    last_day(hire_date)
FROM
    employees
ORDER BY
    2 DESC;

백년 후 2월 달 마지막

SELECT
    last_day(ADD_MONTHS( sysdate-(8*30) , 1200) ),             --( 현재날짜 - (30일 * 8->8개월),  12개월 * 100-->100년)
    last_day( to_date('21200201','YYYYMMDD') )
FROM
    dual;

-- ------------------------------------------------------
-- (6) 날짜 (처리)함수 - ROUND
-- ------------------------------------------------------
-- 날짜를 가장 가까운 년도 또는 월로 반올림하여 반환
-- ------------------------------------------------------
-- ROUND(date1, 'YEAR') : 지정된 날짜의 년도를 반올림(to YYYY/01/01)
-- ROUND(date1, 'MONTH'): 지정된 날짜의 월을 반올림(to YYYY/MM/01)
-- ------------------------------------------------------
SELECT
    last_name,
    hire_date,

    -- 채용날짜의 년도를 반올림(to YYYY/01/01)
    round(hire_date,'YEAR'),
    
    -- 채용날짜의 월을 반올림(to YYYY/MM/01)
    round(hire_date,'MONTH')
FROM
    employees;


-- ------------------------------------------------------
-- (7) 날짜 (처리)함수 - TRUNC
-- ------------------------------------------------------
-- 날짜를 가장 가까운 년도 또는 월로 절삭하여 반환
-- ------------------------------------------------------
-- TRUNC(date1, 'YEAR') : 지정된 날짜의 년도를 절삭(to YYYY/01/01)
-- TRUNC(date1, 'MONTH'): 지정되 날짜의 월을 절삭(to YYYY/MM/01)
-- ------------------------------------------------------
SELECT
    last_name,
    hire_date,

    -- 채용날짜의 년도를 가장 가까운 년도로 절삭(to YYYY/01/01)
    trunc(hire_date, 'YEAR'),
    
    -- 채용날짜의 년도를 가장 가까운 월로 절삭(to YYYY/MM/01)
    trunc(hire_date, 'MONTH')
FROM
    employees;
